Revit 2027 API
Stairs.GetAssociatedRailings Method
 Gets a list of the Railing elements which are associated to the boundaries of the stairs.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICollection<ElementId> GetAssociatedRailings()
Public Function GetAssociatedRailings As ICollection(Of ElementId)
public:
ICollection<ElementId^>^ GetAssociatedRailings()
member GetAssociatedRailings : unit -> ICollection<ElementId>
Return Value
ICollection<ElementId>
 The ids of the Railing elements.
Remarks
 This does not return railings which are sketched directly to the stairs (and are not associated to boundaries).
See Also
Reference
Stairs Class
Autodesk.Revit.DB.Architecture Namespace